Yitcho/STM32F407-MCU-Driver/stm32f4xx_drivers/Src/i2c_slave_tx_string.c
/*
 * i2c_master_tx_testing.c
 *
 *  Created on: May 13, 2023
 *      Author: Mahdi Kaffel
 */

#include <string.h>
#include <stdio.h>

#include "stm32f407xx.h"


#define SLAVE_ADDR	0x69
#define MY_ADDR		SLAVE_ADDR


void delay(void)
{
	for(uint32_t i = 0 ; i < 500000 ; i++);
}

I2C_Handle_t I2C1handle;

uint8_t tx_buff[32]= "STM32 Slave mode testing..";

void I2C1_GPIOInits(void)
{
	GPIO_Handle_t	I2CPins;

	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;

	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	//SCL
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&I2CPins);
	//SDA
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GPIO_Init(&I2CPins);


}

void I2C1_Inits(void)
{

	I2C1handle.pI2Cx = I2C1;
	I2C1handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
	I2C1handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1handle.I2C_Config.I2C_ACKControl = I2C_ACK_ENABLE;
	I2C1handle.I2C_Config.I2C_SclkSpeed = I2C_SCL_SPEED_SM;
	I2C_Init(&I2C1handle);
}



int main(void)
{


	I2C1_GPIOInits();

	I2C1_Inits();
	// I2C IRQ configurations
	I2C_IRQConfig(IRQ_NO_I2C1_EV, ENABLE);
	I2C_IRQConfig(IRQ_NO_I2C1_ER, ENABLE);

	I2C_SlaveEnableDisableCallbackEvents(I2C1,ENABLE);
	// Enable I2C
	I2C_PeripheralControl(I2C1, ENABLE);
	// Ack bit is made 1 after PE = 1 ;
	I2C_ManagAcking(I2C1, I2C_ACK_ENABLE);

	while(1);



}

void I2C1_EV_IRQHandler(void)
{
	I2C_EV_IRQHandling(&I2C1handle);
}

void I2C1_ER_IRQHandler(void)
{
	I2C_ER_IRQHandling(&I2C1handle);

}
// In case of semihosting usage the event call back is helpful for tracing and debugging
void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{
	static uint8_t commandCode = 0 ;
	static uint8_t Cnt = 0 ;

	if(AppEv == I2C_EV_DATA_REQ)
	{
		// Master wants some data
		if(commandCode == 0x51)
		{
			// Send length information to Master
			I2C_SlaveSendData(pI2CHandle->pI2Cx, strlen((char*)tx_buff));
		}else if(commandCode == 0x52)
		{
			// Send content to Tx_Buff
			I2C_SlaveSendData(pI2CHandle->pI2Cx, tx_buff[Cnt++]);
		}
	}else if(AppEv == I2C_EV_DATA_RCV)
	{
		// Data is waiting for the slave to read . Slave has to read it
		commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);
	}else if(AppEv == I2C_ERROR_AF)
	{
		// Master send NACK . So slave should know master doesnt need more data
		commandCode = 0xff;
		Cnt = 0 ;
	}else if(AppEv == I2C_EV_STOP)
	{
		// Master has ended the I2C communication with slave
	}
}
